[graphicalobject]
Name=Lsysinf1
Help= ;
x=47
y=14
;width=273
width=173
height=64
Activate=0
rc-dll=hpleo008.dll
Z-Order=0


[ToolDescriptor]
1=OK,pushbutton,hpgbut02.dll
2=Help,pushbutton,hpgbut02.dll
3=MessageTextL,static,hpgwct02.dll
4=MessageTextM,static,hpgwct02.dll
5=MessageTextS,static,hpgwct02.dll
6=BubbleMessage,statuslist,hpgwct02.dll




[fontalias]
1=bold|ＭＳ Ｐゴシック,9,bold
2=normal|ＭＳ Ｐゴシック,9,normal

[coloralias]
1=InfoTextColor|0,0,0
2=InfoBkColor|192,192,192
;3=ErrorTextColor|255,255,255
3=ErrorTextColor|0,0,0
4=ErrorBkColor|255,0,0
5=WarningTextColor|0,0,0
6=WarningBkColor|255,255,0
7=WaitingTextColor|255,255,255
8=WaitingBkColor|255,0,255



[static MessageTextL]
x=6
y=2
width=148
height=47
Help=この問題について詳しい情報が表示されます。
Text1= ;
Text=
Font=normal
BKCOLOR=InfoBkColor
TextColor=InfoTextColor


[static MessageTextM]
x=6
y=12
width=148
height=32
Help=この問題について詳しい情報が表示されます。
Text1= ;
Text=
Font=normal
BKCOLOR=InfoBkColor
TextColor=InfoTextColor

[static MessageTextS]
x=6
y=18
width=148
height=20
Help=この問題について詳しい情報が表示されます。
Text1= ;
Text=
Font=normal
BKCOLOR=InfoBkColor
TextColor=InfoTextColor



[pushbutton OK]
;x=139
x=155
;y=25
y=11
width=15
height=15
Help=このボタンを押すとバルーン メッセージを隠します。
ImageList=RBMP.OKCHECKMARK|RBMP.OKCHECKMARK|RBMP.OKCHECKMARK|RBMP.OKCHECKMARK
Command=CP3.GuiCloseModuleNrdyInfoBubble  "lsysinf1"
Font=bold


[pushbutton Help]
x=155
y=25
width=15
height=15
Help=この問題について詳しいヘルプ情報が表示されます。
ImageList=RBMP.HELPMARK|RBMP.HELPMARK|RBMP.HELPMARKGRAYED|RBMP.HELPMARK
Command=help.topic 3220
Font=bold





[statuslist BubbleMessage]
delayed=0
enable=0
x=-16
y=0
width=190
height=64
;Cursor=Hand
Help=この問題について詳しい情報が表示されます。
Image1=RBMP.SpeechBlack
x1=0
y1=0
ROP1=SCRCOPY
Image2=RBMP.TalkMethod
x2=17
y2=2
ROP2=SCRCOPY
Image7=Status / Error
x7=23
y7=20
Image8=message text
x8=23
y8=33
Symbols1=Mth|LInj|LPump|LThm1|LThm2|LClc1|Det1|Det2|Det3|Det4|LAfc|DA|GLP|ERROR|WARNING|INFO|WAITING
Elements=LInj|INFO
;Command=@view.floatingmenu "menu[1]", "LeoALS"
ImageStart=1
ElementStart=1
ElementEnd=2
Font=bold
RcDll=hpleo008.dll
RcDll1=hpleo008.dll
Mth=RBMP.SpeechMethod
LInj=RBMP.SpeechInjector
LPump=RBMP.SpeechPump
LThm1=RBMP.SpeechColumn
LThm2=RBMP.SpeechColumn
LClc1=RBMP.SpeechColumn
Det1=RBMP.SpeechDet1
Det2=RBMP.SpeechDet2
Det3=RBMP.SpeechDet3
Det4=RBMP.SpeechDet4
LAfc=RBMP.SpeechAfc
DA=RBMP.SpeechDA
GLP=RBMP.SpeechGLP
ERROR=RBMP.SpeechError
WARNING=RBMP.SpeechWARNING
INFO=RBMP.SpeechInfo
WAITING=RBMP.SpeechHiWarning

